Solidification/defense/007_sol_xHa50_tridirec/0/pB
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pB;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    lowerWall
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            zeroGradient;
    }

    leftWall
    {
        type            fixedValue;
        value           $internalField;
    }
    
    rightWall
    {
        type            fixedValue;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
